DataProcessors/УстановкаЗначенийПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>УстановкаЗначенийПоУмолчанию</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИспользуемыеПравилаЭкспортаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИспользуемыеПравилаЭкспортаДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаЭкспортаДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РеквизитыТТН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>РеквизитыТТН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Перевозчики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборИзСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыбораИзСписка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеГородПриВыбореОтделенияНовойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыТТН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеНомераДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеКоличестваМест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеОписанияМест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыТТН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктДоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнитьЗначениеТекстом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопТекстовыеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочникаВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаЭкспортаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПравилаЭкспортаДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Перевозчики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Правила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитТТН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыТТН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверятьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыПользовательскихНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПриУстановке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьРеализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСрокНахожденияНаСкладе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьСхемуРезервирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуНаОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВнПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаВнПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуСрокХранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСрокХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаГруппеПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьМаркетПлэйс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТелеграм</Name>
					<Comment>Уведомление уходит в тот же момент, когда создаётся задача просрочки статуса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧат</Name>
					<Comment>chat_id получателя уведомления. Узнаётся один раз: получатель нажимает Start у бота, затем ТелеграмБот.ПоказатьНовыеЧаты().</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредыдущиеСтатусыУсловиеОтправкиСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/УстановкаЗначенийПоУмолчанию/Ext/ObjectModule.bsl
Процедура СоздатьРеквизитыТТН() Экспорт
	Владелец = Справочники.Перевозчики.НайтиПоНаименованию("Новая почта");
	Если НЕ ЗначениеЗаполнено(Владелец) тогда
		Об = Справочники.Перевозчики.СоздатьЭлемент();
		Об.Наименование = "Новая почта";
		Об.Идентификатор = "новаяпочта";
		Об.Записать();
		Владелец = Об.Ссылка;
	КонецЕсли;	
	
	ТД = ПолучитьМакет("РеквизитыТТН");
	Строк = ТД.ВысотаТаблицы;
	Для хх = 2 пО Строк Цикл
		Об = Справочники.РеквизитыТТН.СоздатьЭлемент();
		Об.Владелец = Владелец;
		Об.Наименование = СокрЛП(ТД.Область("R" + хх + "C3").Текст);
		Об.Код = СокрЛП(ТД.Область("R" + хх + "C2").Текст);
		Об.Обязательный = ТД.Область("R" + хх + "C4").Текст = "Да";
		Об.Порядок = ТД.Область("R" + хх + "C5").Текст;
		Об.ВыборИзСписка = ТД.Область("R" + хх + "C6").Текст = "Да";
		Если ТД.Область("R" + хх + "C7").Текст = "ХранилищеЗначения" Тогда
			
			Сп = Новый СписокЗначений;
			Сп.Добавить(0, "Нет");
			Сп.Добавить(1, "Да");
			
			Об.СписокВыбора = Новый ХранилищеЗначения(Сп);
		КонецЕсли;	
		Об.РежимВыбораИзСписка = ТД.Область("R" + хх + "C8").Текст;
		Если ЗначениеЗаполнено(ТД.Область("R" + хх + "C9").Текст) Тогда
			Об.ПолеГородПриВыбореОтделенияНовойПочты = Справочники.РеквизитыТТН.НайтиПоНаименованию(ТД.Область("R" + хх + "C9").Текст);
		КонецЕсли;
		
		Об.ПолеНомераДокумента = ТД.Область("R" + хх + "C10").Текст = "Да";
		Об.ПолеКоличестваМест = ТД.Область("R" + хх + "C11").Текст = "Да";
		
		Если ЗначениеЗаполнено(ТД.Область("R" + хх + "C12").Текст) Тогда
			Об.ПолеОписанияМест = Справочники.РеквизитыТТН.НайтиПоНаименованию(ТД.Область("R" + хх + "C12").Текст);
		КонецЕсли;
		
		Об.ПунктОтправления = ТД.Область("R" + хх + "C13").Текст = "Да";
		Об.ПунктДоставки = ТД.Область("R" + хх + "C14").Текст = "Да";
		Об.ИмяСправочникаВыбора = ТД.Область("R" + хх + "C15").Текст;
		Об.Записать();		
	КонецЦикла;	
КонецПроцедуры	

Процедура СоздатьПравило() Экспорт
	
	Владелец = Справочники.Перевозчики.НайтиПоНаименованию("Новая почта");
	Если НЕ ЗначениеЗаполнено(Владелец) тогда
		Об1 = Справочники.Перевозчики.СоздатьЭлемент();
		Об1.Наименование = "Новая почта";
		Об1.Идентификатор = "новаяпочта";
		Об1.Записать();
		Владелец = Об1.Ссылка;
	КонецЕсли;	

	Об = Справочники.ПравилаЭкспортаДокументов.СоздатьЭлемент();
	Об.Владелец = Владелец;
	Об.ДокументСсылка = Документы.ЗаказПокупателя.ПустаяСсылка();
	Об.Наименование = "Заказ покупателя";
	СТр = Об.ОбъектыПользовательскихНастроек.Добавить();
	Стр.Объект = "Организация";
	Стр.ТипыОбъекта = "Справочник.Организации,";
	
	СТр = Об.ОбъектыПользовательскихНастроек.Добавить();
	Стр.Объект = "Контрагент";
	Стр.ТипыОбъекта = "Справочник.Контрагенты,";

	Макет = ПолучитьМакет("ПравилаЭкспорта");
	Строк = Макет.ВысотаТаблицы;
	Для хх = 2 По Строк Цикл
		Стр = Об.Правила.Добавить();
		Стр.РеквизитТТН = Справочники.РеквизитыТТН.НайтиПоНаименованию(Макет.Область("R" + хх + "C1").Текст);
		Стр.Выражение = СокрЛП(Макет.Область("R" + хх + "C3").Текст);
		Стр.ВыражениеПредставления = СокрЛП(Макет.Область("R" + хх + "C4").Текст);
		Стр.РеквизитДокумента = СокрЛП(Макет.Область("R" + хх + "C2").Текст);
	КонецЦикла;	
	
	об.Записать();
	
	НЗ = РегистрыСведений.ИспользуемыеПравилаЭкспортаДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.Перевозчик.установить(Владелец);
	НЗ.Отбор.ДокументСсылка.установить(Документы.ЗаказПокупателя.ПустаяСсылка());
	Запись = НЗ.Добавить();
	Запись.ДокументСсылка   = Документы.ЗаказПокупателя.ПустаяСсылка();
	Запись.Перевозчик = Владелец;
	Запись.Правило = Об.Ссылка;
	НЗ.Записать();
КонецПроцедуры	

Процедура ЗаполнитьВсе() Экспорт
	СоздатьРеквизитыТТН();
	СоздатьПравило();
	ЗаполнитьСтатусы();
	Сообщить("Справочники ""Реквизиты ТТН"" и ""Правила экспорта документов"" созданы!");
КонецПроцедуры

Процедура ЗаполнитьСтатусы() Экспорт
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	СтатусыЗаказов.Ссылка
|ИЗ
|	Справочник.СтатусыЗаказов КАК СтатусыЗаказов";
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Возврат;
КонецЕсли;	
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000006";
		Об.Наименование = "На возврате";
		Об.Порядок = 6;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000007";
		Об.Наименование = "Не удачные";
		Об.Порядок = 7;
		Об.Записать();
		
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000005";
		Об.Наименование = "Ожидает оплаты";
		Об.Порядок = 5;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000002";
		Об.Наименование = "Ожидает отправки";
		Об.Порядок = 2;
		Об.Записать();
		ОжидаетОтправки = Об.Ссылка;
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000001";
		Об.Наименование = "Продано";
		Об.Порядок = 1;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000009";
		Об.Наименование = "укр.почта";
		Об.Порядок = 10;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000010";
		Об.Наименование = "укрпочта отправлено";
		Об.Порядок = 11;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000003";
		Об.Наименование = "ЦБ не получена";
		Об.Порядок = 3;
		Об.ОтправлятьСМСПриУстановке  = истина;
		Об.ФормироватьРеализацию = Истина;
		Об.ПроверятьСрокНахожденияНаСкладе = Истина;
		Об.ПредыдущиеСтатусыУсловиеОтправкиСМС.Добавить().СтатусЗаказа = ОжидаетОтправки;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000004";
		Об.Наименование = "Завершенные";
		Об.Порядок = 4;
		Об.ПредыдущиеСтатусыУсловиеОтправкиСМС.Добавить().СтатусЗаказа = ОжидаетОтправки;
		Об.Записать();
		
		Об = Справочники.СтатусыЗаказов.СоздатьЭлемент();
		Об.Код = "000000008";
		Об.Наименование = "Отказ";
		Об.Порядок = 8;
		Об.Записать();
КонецПроцедуры
